Repository: giellalt/corpus-sma
Catalog: tmx/eng/facta/1177.se/tolktjanst.html.tmx
Source language: sma
Languages: eng

source: Åarjelsaemiengiele / Sydsamiska
eng: Back to the start page for this theme

source: ÅarjelsaemiengieleSydsamiska
eng: Various types of interpreting (ca 2 sidor)

source: ToelhkestimmiedïenesjeTolktjänst
eng: Tell caregivers what you need (ca 1 sida)

source: Jeatjah gïelide toelhkestidh
eng: Written information not translated (ca 1 sida)

source: Dïhte sæjhta jiehtedh barkijh, jis daarpesje, edtjieh toelhkem utnedh gosse bievnieh. Maahta jïjtje krïevedh toelhkem åadtjodh, jis ij naan gihtjieh jis dam daarpesje.
eng: If you have difficulty speaking or understanding Swedish, you are entitled to an interpreter when you see a doctor, dentist or other caregiver.

source: Dellie tjïeltem beavna, man dïedtem tjaangedæjjatoelhki åvteste åtna.
eng: Caregivers can usually arrange an interpreter for you.

source: Tjaangedæjjah gïeh toelhkem daarpesjieh gosse healsoe- jïh skïemtjehoksem gaskesadtedh daamhtaj lea fuelhkieh jïh voelph gïeh maehtieh viehkine årrodh.
eng: Tell the staff that you need an interpreter when you first make an appointment.

source: Gusnie gaskeladtja ?
eng: Various types of interpreting (ca 2 sidor)

source: Maahta tjïelten telefovnevïekselem bievnedh mij maahta vijriebasse saehtedh.
eng: Tell caregivers what you need (ca 1 sida)

source: Toelhkestimmiejarnge
eng: Written information not translated (ca 1 sida)

source: Jeenjemes laantedigkie / regijovnh toelhkejarngem utnieh mearan naan dïenesjh utnieh mejtie maehtieh bievnedh.
eng: An interpreter is under an oath of confidentiality and cannot disclose information about you without your approval.

source: Toelhkejarngesne berkieh sjïereööhpehtamme toelhkide:
eng: Family and friends who interpret for you are not subject to confidentiality.

source: Bieljehts-tjelmehtstoelhkh bieljehts-tjelmehtsidie jallh dejtie mahte bieljehts jallh tjelmehts persovnidie.
eng: Various types of interpreting

source: Toelhkh darjoeh guktie govlijes almetjh jïh bieljehts / mahte bieljehts maehtieh gaskesadtedh.
eng: Various types of interpreting

source: Toelhkedïenesje namhtah jïh maahta toelhkem dongkedh laantedigkien toelhkejarngen tjïrrh gaajhkh tsiehkine gosse veanhta dam daarpesjidh.
eng: An interpreter translates what caregivers say in a way that you can understand and that enables you to influence your treatment (see Patient Act).

source: Dam dejtie dovne bieljehts maanabaeleste, mahte bieljehts, geervebieljehts, bieljehts-tjelmehts jïh govlijes.
eng: You may be entitled to an interpreter when you see a doctor, dentist or other caregiver.

source: Jis toelhkem daarpesje maahta jïjtse laantedigkien toelhkejarngem bievnedh.
eng: The interpreter may be at the appointment in person.

source: Hälso- och sjukvårdslagen / Healsoe- jïh skïemtjehokselaake, SFS., 1982:763
eng: The interpreter may participate on a speaker phone.

source: Soptsesedïenesje lea namhtah dïenesje jis gïele-, soptsese- jallh gïeledåeriesmoerem åtna. Soptsesedïenesjisnie soptsesedïenesjetoelhkestæjjah berkieh.
eng: The interpreter may be able to video conference— a computer and web camera will allow you, the caregiver and the interpreter to communicate with each other.

source: Soptesedåarjoe, mij lea soptsesedïenesjetoelhkestæjjah lea persovneles gaskesadtemedåarjoe bïeljelimmine mah ovvihties jïh gïerve damtedh.
eng: Group interpreting may be appropriate if several people speak the same language and will receive the same information.

source: Dah jiehtieh baakoeh ikth vielie jïh / jallh tjïelkesieh soptsesem jallh vuekiem guktie gaskesadta.
eng: A typical situation is when several different parents get together at a child welfare centre.

source: Telefovnedåarjoe, mij lea viehkiem åådtje golmepaartesoptsestimmieh ringkedh gusnie soptsesedïenesjetoelhke aalka jïh jis daerpies tjïelkese jïh bïhkede men dan mænngan barre duekesne gååvnese.
eng: Ask your caregivers what kind of interpreting is available to you.

source: Lohkeme- jïh tjaelemedåarjoe, mij lea viehkiem åådtje prieviem jïh tjaalegh lohkedh jïh / jallh tjaeledh, våålese tjaala tjåanghkosne jïh jienebe.
eng: Tell caregivers what you need

source: Laantedigkien telefovnevieksele daajra jis gååvnese Soptsesedïenesje laantedigkesne jallh ij.
eng: Make sure to let the staff know that you need an interpreter either when you make an appointment or well in advance.

source: Telesoptsese
eng: Explain what language you want.

source: Telesoptsese lea namhtah jïh abpe rïjhkesne dïenesje jis gïele-, soptsese- jallh gïeledåeriesmoerem åtna.
eng: If you cannot go to the appointment, the interpreter must be informed ahead of time.

source: Telesoptsesisnie soptsestimmietoelhkh berkieh jïh dah ajve sveerjen gïeline toelhkestidh.
eng: Some county councils charge you for the services of the interpreter if you fail to cancel.

source: Desnie maahta dej dïenesjigujmie viehkiem åadtjodh:
eng: Each county council has its own cancellation procedures.

source: Teletoelhkh gïeh gïerve baakoeh jïh jiehtesh toelhkestieh jis dåeriesmoerem åtna govledh jallh guarkedh maam jeahta.
eng: Written information not translated

source: Toelhke aath bïhkede guktie dah leah jis dam daarpesje.
eng: Written information not translated

source: Telesoptsese lea meatan dåarjojne abpe soptsesesne.
eng: Interpreters do not normally translate written material.

source: Dah maehtieh tjaeledh maam jiehtesåvva jïh dam hïejmese seedtedh.
eng: www.1177.se contains information in a number of different languages about childhood diseases, the healthcare system in general, etc..

source: Toelhke ringkie dïsse maam sæjhta ringkedh jïh meatan dåarjojne orre.
eng: Tell caregivers what you need (ca 1 sida)

source: Redaktööre:
eng: Written information not translated (ca 1 sida)

source: Goerehtæjja: Tekstem goerehte Hjälpmedelsinstituhten ektesne.
eng: Reviewer: Anna Åberg, national adviser, legal division, Sveriges kommuner och Landsting, Stockholm

source: Gaajhkh sisvegisnie lea barkeme, goerehtamme jïh dååhkesjahteme redaksjovneste jïh redaksjovneraereste 1177 Vårdguiden.
eng: The content has been processed, reviewed and approved by the editorial team and the editorial council at 1177 Vårdguiden.
